Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>Контрагенты (покупатели, поставщики и т.д.)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дополнительно</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБ24</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомерПлательщикаЕвропейскогоНДС</Name>
					<Comment>VAT Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПодписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправлятьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДопИнформацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотолкиОнлайн_Актуализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотолкиОнлайн_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Опт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойEMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОсновнойТелефон_ТолькоЦифры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ПереноситьДокументыВБухгалтерию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Розница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МеткиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставкиТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УДАЛИТЬ_АдресаДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Контрагенты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Листок";
	КомандаПечати.Представление = НСтр("ru = 'Информационный лист дилера'");
	//КомандаПечати.СписокФорм = "ФормаЭлемента,ФормаСписка";
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Информационный лист дилера'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Листок") Тогда
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
        	КоллекцияПечатныхФорм,
        	"Листок",
        	НСтр("ru = 'Информационный лист дилера'"),
        	СформироватьПечатнуюФормуИнформации(МассивОбъектов, ОбъектыПечати));
    КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуИнформации(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб         = Истина; //#14053
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Контрагент";
	Макет = ПолучитьМакет("Макет");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Листок");
	ОбластьМакета.Параметры.Заполнить(МассивОбъектов[0]);
	ОбластьМакета.Параметры.АдресДилерскогоСайта = Константы.АдресДилерскогоСайта.Получить();
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

Процедура ПеревестиПризнакиОптРозницаВГруппыДоступаККонтрагентам() Экспорт
	
	// №6293 необходимо получить контрагентов, у которых:
	//	- установлена одна из галочек Опт или Розница
	//  - текущая группа доступа НЕ из предопределенных
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникКонтрагенты.Ссылка,
		|	СправочникКонтрагенты.ГруппаДоступа,
		|	СправочникКонтрагенты.УДАЛИТЬ_Опт КАК Опт,
		|	СправочникКонтрагенты.УДАЛИТЬ_Розница Розница,
		|	ВЫБОР
		|   	КОГДА СправочникКонтрагенты.УДАЛИТЬ_Опт И СправочникКонтрагенты.УДАЛИТЬ_Розница
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.Общие)
		|		КОГДА СправочникКонтрагенты.УДАЛИТЬ_Опт
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентОпта)
		|		КОГДА СправочникКонтрагенты.УДАЛИТЬ_Розница
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентРозницы)
		|		ИНАЧЕ Значение(Справочник.ГруппыДоступаККонтрагентам.ПустаяСсылка)
		|	КОНЕЦ КАК НоваяГруппаДоступа
		|ИЗ
		|	Справочник.Контрагенты КАК СправочникКонтрагенты
		|ГДЕ
		|	(СправочникКонтрагенты.УДАЛИТЬ_Опт
		|		ИЛИ СправочникКонтрагенты.УДАЛИТЬ_Розница)
		|	И НЕ СправочникКонтрагенты.ГруппаДоступа В (Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентОпта), 
		|												Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентРозницы), 
		|												Значение(Справочник.ГруппыДоступаККонтрагентам.Общие))
		|	И ВЫБОР
		|		КОГДА &ТолькоЗаполненные
		|			ТОГДА НЕ СправочникКонтрагенты.ГруппаДоступа = Значение(Справочник.ГруппыДоступаККонтрагентам.ПустаяСсылка)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	
	// 1. Сначала подготовим группы доступа, сюда попадут все созданные вручную, по ним нужно создать дубликаты с постфиксом -Опт - Розница - Общая
	Запрос.УстановитьПараметр("ТолькоЗаполненные", Истина);
	ГруппыДоступа = Запрос.Выполнить().Выгрузить();
	ГруппыДоступа.Свернуть("Опт, Розница, ГруппаДоступа");
	ГруппыДоступа.Колонки.Добавить("НоваяГруппаДоступа", новый ОписаниеТипов("СправочникСсылка.ГруппыДоступаККонтрагентам"));
	
	Для Каждого ТекущаяСтрока Из ГруппыДоступа Цикл
		
		Наименование = ТекущаяСтрока.ГруппаДоступа.Наименование;
		// Проверим, не созданная ли это группа доступа нами, если да, то просто её подставим иначе создадим новую (с предварительным поиском)
		Если СтрНайти(Врег(Наименование), "-ОПТ") = 0 И СтрНайти(Врег(Наименование), "-РОЗНИЦА") = 0 И СтрНайти(Врег(Наименование), "-ОБЩАЯ") = 0 Тогда
			
			Постфикс = "";
			Если ТекущаяСтрока.Опт И ТекущаяСтрока.Розница Тогда
				Постфикс = "-Общая";
			ИначеЕсли ТекущаяСтрока.Опт Тогда
				Постфикс = "-Опт";
			ИначеЕсли ТекущаяСтрока.Розница Тогда
				Постфикс = "-Розница";
			КонецЕсли;	
				
			НайденныйЭлемент = Справочники.ГруппыДоступаККонтрагентам.НайтиПоНаименованию(Наименование + Постфикс, Истина);
			Если НЕ НайденныйЭлемент.Пустая() Тогда
				
				ТекущаяСтрока.НоваяГруппаДоступа = НайденныйЭлемент;
				
			Иначе
				
				ОбъектГруппаДоступа = Справочники.ГруппыДоступаККонтрагентам.СоздатьЭлемент();
				ОбъектГруппаДоступа.Наименование = Наименование + Постфикс;
				
				Попытка
					ОбъектГруппаДоступа.Записать();
					ТекущаяСтрока.НоваяГруппаДоступа = ОбъектГруппаДоступа.Ссылка;
				Исключение
					ЗаписьЖурналаРегистрации("Справочник ""Группы доступа к контрагентам"" создание нового элемента", УровеньЖурналаРегистрации.Ошибка,, ОбъектГруппаДоступа.Ссылка, "Не удалось создать группу доступа: " + ОписаниеОшибки());
				КонецПопытки;
				
			КонецЕсли;	
			
		Иначе
			
			ТекущаяСтрока.НоваяГруппаДоступа = ТекущаяСтрока.ГруппаДоступа;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// 2. Теперь меняем в карточке контрагента
	Запрос.УстановитьПараметр("ТолькоЗаполненные", Ложь);
	Выборка = Запрос.Выполнить().Выбрать();
	
	// Если у контрагента не задана группа доступа и установлено:
	//	- только галочка "Контрагент розницы", то ставить ему предопределенную группу доступа "Розница"
	//	- только галочка "Контрагент опта", то ставить ему предопределенную группу доступа "Контрагент опта"
	//	- галочка "Контрагент опта" и "Контрагент розницы", то ставить ему предопределенную группу доступа "Общие"
	// Если у контрагента задана группа доступа и установлено:
	//	- только галочка "Контрагент розницы", создавать новую группу доступа с наименованием предыдущей группы доступа и через тире добавить "Розница" и присвоить данную группу данному контрагенту
	//	- только галочка "Контрагент опта", создавать новую группу доступа с наименованием предыдущей группы доступа и через тире добавить "Опт" и присвоить данную группу данному контрагенту
	//	- галочка "Контрагент опта" + "Контрагент розницы", создавать новую группу доступа с наименованием предыдущей группы доступа и через тире добавить "Общая" и присвоить данную группу данному контрагенту
			
	Пока Выборка.Следующий() Цикл
		
		КонтрагентОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		// группа доступа не указана, просто установим предопределенную группу доступа в зависимости от галочек
		Если Выборка.ГруппаДоступа.Пустая() Тогда
			
			КонтрагентОбъект.ГруппаДоступа = Выборка.НоваяГруппаДоступа;
			
		// группа доступа указана, нужно получить соответствие на неё из таблицы
		Иначе
			
			НайденнаяГруппаДоступа = ГруппыДоступа.НайтиСтроки(новый Структура("Опт, Розница, ГруппаДоступа", Выборка.Опт, Выборка.Розница, Выборка.ГруппаДоступа));
			Если НайденнаяГруппаДоступа.Количество() > 0 Тогда
				КонтрагентОбъект.ГруппаДоступа = НайденнаяГруппаДоступа[0].НоваяГруппаДоступа;
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			КонтрагентОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Справочник ""Контрагенты"" установка группы доступа", УровеньЖурналаРегистрации.Ошибка,, Выборка.Ссылка, "Не удалось установить группу доступа: " + ОписаниеОшибки());
		КонецПопытки;
			
	КонецЦикла;
	
	// 3. если у пользователя был настроен доступ к контрагентам через галочки, то выдать ему права доступа на соответствующие группы доступа контрагентов
	// в т.ч. к вновь созданным если они должны быть ему доступны и включить ограничение доступа по группам доступа контрагентов
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникПользователи.Ссылка,
		|	СправочникПользователи.УДАЛИТЬ_Опт КАК Опт,
		|	СправочникПользователи.УДАЛИТЬ_Розница Розница,
		|	ВЫБОР
		|		КОГДА СправочникПользователи.УДАЛИТЬ_ОграничиватьВидимостьКонтрагентов И (СправочникПользователи.УДАЛИТЬ_Опт ИЛИ СправочникПользователи.УДАЛИТЬ_Розница)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВключитьОграничениеДоступаККонтрагентамПоГруппаДоступа,
		|	ВЫБОР
		|   	КОГДА СправочникПользователи.УДАЛИТЬ_Опт И СправочникПользователи.УДАЛИТЬ_Розница
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.Общие)
		|		КОГДА СправочникПользователи.УДАЛИТЬ_Опт
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентОпта)
		|		КОГДА СправочникПользователи.УДАЛИТЬ_Розница
		|			ТОГДА Значение(Справочник.ГруппыДоступаККонтрагентам.КонтрагентРозницы)
		|		ИНАЧЕ Значение(Справочник.ГруппыДоступаККонтрагентам.ПустаяСсылка)
		|	КОНЕЦ КАК НоваяГруппаДоступа
		|ИЗ
		|	Справочник.Пользователи КАК СправочникПользователи
		|ГДЕ
		|	(СправочникПользователи.УДАЛИТЬ_ОграничиватьВидимостьКонтрагентов И (СправочникПользователи.УДАЛИТЬ_Опт ИЛИ СправочникПользователи.УДАЛИТЬ_Розница))
		|		ИЛИ	СправочникПользователи.ДоступныеГруппыКонтрагентов.ГруппаКонтрагентов В (&ГруппыДоступа)";
	Запрос.УстановитьПараметр("ГруппыДоступа", ГруппыДоступа.ВыгрузитьКолонку("ГруппаДоступа"));
	
	// в выборку попадают пользователи, у которых:
	//	- было включено ограничение по Рознице или Опт (галочка Ограничивать видимость также должна быть установлена)
	//	- у пользователей задана группа доступа, по которой создавались новые с постфиксами -Опт, -Розница, -Общие (нужно их указать пользователю)
	
	// Галочка "ОграничиватьДоступККонтрагентамПоГруппамДоступа" будет установлена, если только у пользователя установлена галочка "ОграничиватьВидимостьКонтрагентов" и есть один из признаков Опт или Розница
	// в других случаях мы просто добавляем созданные группы доступа в доступные
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПользовательОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		// Проверим и при необходимости добавим группы доступа с постфиксами
		Для Каждого ТекущаяСтрока Из ПользовательОбъект.ДоступныеГруппыКонтрагентов Цикл
			
			НайденныеГруппыДоступа = ГруппыДоступа.НайтиСтроки(новый Структура("ГруппаДоступа", ТекущаяСтрока.ГруппаКонтрагентов));
			
			Для Каждого ТекущаяГруппа Из НайденныеГруппыДоступа Цикл
				
				// Проверим, может уже есть у пользователя данная группа доступа, повторно добавлять не требуется
				НайденнаяГруппаУПользователя = ПользовательОбъект.ДоступныеГруппыКонтрагентов.НайтиСтроки(новый Структура("ГруппаКонтрагентов", ТекущаяГруппа.НоваяГруппаДоступа));
				Если НайденнаяГруппаУПользователя.Количество() = 0 Тогда
					
					// в ТЧ нет, добавляем
					НоваяСтрока = ПользовательОбъект.ДоступныеГруппыКонтрагентов.Добавить();
					НоваяСтрока.ГруппаКонтрагентов = ТекущаяГруппа.НоваяГруппаДоступа;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Выборка.ВключитьОграничениеДоступаККонтрагентамПоГруппаДоступа Тогда
			
			ПользовательОбъект.ОграничиватьДоступККонтрагентамПоГруппамДоступа = Истина;
			
			// Нужно добавить соответсвующую группу доступа (опираясь на выставленные галочки)
			НайденнаяГруппаУПользователя = ПользовательОбъект.ДоступныеГруппыКонтрагентов.НайтиСтроки(новый Структура("ГруппаКонтрагентов", Выборка.НоваяГруппаДоступа));
			Если НайденнаяГруппаУПользователя.Количество() = 0 Тогда
				
				// в ТЧ нет, добавляем
				НоваяСтрока = ПользовательОбъект.ДоступныеГруппыКонтрагентов.Добавить();
				НоваяСтрока.ГруппаКонтрагентов = Выборка.НоваяГруппаДоступа;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка
			ПользовательОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("Справочник ""Пользователи"" запись объекта", УровеньЖурналаРегистрации.Ошибка,, ПользовательОбъект.Ссылка, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецЕсли
